# Formulas
tap "asmvik/formulae"
tap "cormacrelf/tap"
tap "FelixKratz/formulae"
tap "spicetify/tap"
tap "tinted-theming/tinted"

# Window Manager
brew "FelixKratz/formulae/borders", restart_service: :changed
brew "FelixKratz/formulae/sketchybar"
brew "asmvik/formulae/skhd"
brew "asmvik/formulae/yabai"

# Terminal Toys
brew "cbonsai"
brew "cmatrix"
brew "pipes-sh"

# System Monitoring
brew "fastfetch"
brew "macmon"

# CLI — Core Replacements
brew "bat"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ripgrep"
brew "zoxide"

# CLI — Tools
brew "curl"
brew "delta"
brew "duckdb"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-getopt"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "leetgo"
brew "p7zip"
brew "tig"

# CLI — Shell
brew "bash"
brew "dash-shell"
# Zsh
brew "antidote"

# Editors
brew "neovim"

# Languages
brew "lua"
brew "luarocks"
brew "uv"

# Build Dependencies
brew "make"
brew "zlib"

# Themes
brew "cormacrelf/tap/dark-notify"
brew "tinted-theming/tinted/tinted-builder-rust"

# General
brew "chezmoi"
brew "mise"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "media-control"
brew "spicetify-cli"

# Fonts
cask "font-new-york"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
brew "fontforge"

# AI
cask "codex"

# Secrets
brew "bitwarden-cli"
brew "gnupg"

# Applications
cask "appcleaner"
cask "betterdisplay"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "keepingyouawake"
cask "logitune"
cask "obsidian"
cask "orbstack"
cask "protonvpn"
cask "raycast"
cask "sf-symbols"
cask "spotify"
cask "stats"
cask "thaw"
cask "ungoogled-chromium"
cask "zed"
cask "zen"
cask "zoom"

# Mac App Store
brew "mas"
# mas "Copilot", id: 1447330651
# mas "Dynamic wallpaper", id: 1582358382
# mas "Steam Link", id: 1246969117
