# Formulas
tap "asmvik/formulae"
tap "cormacrelf/tap"
tap "FelixKratz/formulae"
tap "spicetify/tap"
tap "tinted-theming/tinted"

# Desktop Environment
brew "cbonsai"
brew "cmatrix"
brew "cormacrelf/tap/dark-notify"
brew "fastfetch"
brew "FelixKratz/formulae/borders"
brew "macmon"
brew "pipes-sh"
brew "FelixKratz/formulae/sketchybar"
brew "asmvik/formulae/skhd"
brew "spicetify-cli"
brew "tmux"
brew "asmvik/formulae/yabai"

# CLI — Core Replacements
brew "bat"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ripgrep"

# CLI — Tools
brew "delta"
brew "fzf"
brew "git"
brew "git-lfs"
brew "hyperfine"
brew "tig"

# CLI - Shell
brew "bash"
brew "dash-shell"
# Zsh
brew "antidote"

# Editors
brew "neovim"

# Lua
brew "lua"

# Python
brew "uv"

# Themes
brew "tinted-theming/tinted/tinted-builder-rust"

# General
brew "chezmoi"
brew "mise"

# Media
brew "imagemagick"
brew "media-control"

# Fonts
cask "font-sf-pro"
brew "fontforge"

# AI
cask "claude"
cask "claude-code@latest"

# Secrets
cask "bitwarden"
brew "bitwarden-cli"
